<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Chapter 1. LINUX&#27010;&#36848;</title><link rel="stylesheet" type="text/css" href="/blog/linux/common/common.css"><meta name="generator" content="DocBook XSL Stylesheets V1.77.1"><link rel="home" href="index.html" title="linux&#25216;&#26415;&#25163;&#20876;"><link rel="up" href="index.html" title="linux&#25216;&#26415;&#25163;&#20876;"><link rel="prev" href="index.html" title="linux&#25216;&#26415;&#25163;&#20876;"><link rel="next" href="ch02.html" title="Chapter 2. &#21629;&#20196;&#27719;&#24635;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter 1. LINUX&#27010;&#36848;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="ch02.html">Next</a></td></tr></table><hr></div><div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="id560621"></a>Chapter 1. LINUX&#27010;&#36848;</h1></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl><dt><span class="sect1"><a href="ch01.html#id560629">Linux&#31616;&#20171;</a></span></dt></dl></div>
    <p>&#25968;&#25454;&#24211;&#29702;&#35770;&#22522;&#30784; </p>

    <div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="id560629"></a>Linux&#31616;&#20171;</h2></div></div></div>
      <p>&#12288;
        Linux&#20869;&#26680;&#26159;UNIX&#20869;&#26680;&#30340;&#24320;&#28304;&#23454;&#29616;&#19982;&#36229;&#36234;&#65292;&#23427;&#26368;&#21021;&#30001;Linus Torvalds&#20110;1991&#24180;&#30340;10&#26376;5&#26085;&#29420;&#31435;&#21457;&#34920;&#65292;&#29616;&#22312;Linus TorvaldsLinus Torvalds&#30001;&#20840;&#29699;&#20247;&#22810;&#32452;&#32455;&#21644;&#20010;&#20154;&#20849;&#21516;&#24320;&#21457;&#20197;&#21450;&#32500;&#25252;&#12290; 
    </p>
    <p>
        Linux&#19968;&#33324;&#25351;Linux&#20869;&#26680;&#65292;&#32780;GNU/Linux&#25351;&#20197;Linux&#20026;&#20869;&#26680;&#24182;&#20351;&#29992;GNUuserland&#30340;&#25104;&#22871;&#25805;&#20316;&#31995;&#32479;&#12290;Linux&#19981;&#26159;UNIX&#65292;&#20005;&#26684;&#26469;&#35762;&#20063;&#19981;&#26159;&#31867;UNIX&#65292;&#20294;&#26159;&#22914;&#20170;&#21364;&#26159;UNIX&#23478;&#26063;&#30340;&#20195;&#34920;&#32773;&#65292;&#20063;&#26159;&#24320;&#28304;&#36719;&#20214;&#30340;&#25104;&#21151;&#26696;&#20363;&#12290; 
    </p>
    <p>
        &#24050;&#30693;&#30340;&#36739;&#26089;&#26102;&#38388;&#65288;1992&#24180;&#19978;&#21322;&#24180;&#33267;1994&#24180;&#19979;&#21322;&#24180;&#65289;&#21457;&#24067;&#30340;GNU/Linux&#20381;&#27425;&#20026;MCC Interim&#12289;TAMU&#12289;SLS&#12289;Yggdrasil&#12289;DLD&#12289;Slackware&#12289;Debian Linux Release&#12289;LST&#12289;Bogus&#12289;S.u.S.E&#21644;Red Hat Linux&#65292;&#26368;&#21021;&#30340;Slackware&#22522;&#20110;SLS&#65292;&#26368;&#21021;&#30340;S.u.S.E&#22522;&#20110;Slackware&#12290;
    </p>
   <p>
        &#12288;Linux&#26159;&#19968;&#22871;&#20813;&#36153;&#20351;&#29992;&#21644;&#33258;&#30001;&#20256;&#25773;&#30340;&#31867;Unix&#25805;&#20316;&#31995;&#32479;&#65292;&#26159;&#19968;&#20010;&#22522;&#20110;POSIX&#21644;UNIX&#30340;&#22810;&#29992;&#25143;&#12289;&#22810;&#20219;&#21153;&#12289;&#25903;&#25345;&#22810;&#32447;Linux LogoLinux Logo&#31243;&#21644;&#22810;CPU&#30340;&#25805;&#20316;&#31995;&#32479;&#12290;&#23427;&#33021;&#36816;&#34892;&#20027;&#35201;&#30340;UNIX&#24037;&#20855;&#36719;&#20214;&#12289;&#24212;&#29992;&#31243;&#24207;&#21644;&#32593;&#32476;&#21327;&#35758;&#12290;&#23427;&#25903;&#25345;32&#20301;&#21644;64&#20301;&#30828;&#20214;&#12290;Linux&#32487;&#25215;&#20102;Unix&#20197;&#32593;&#32476;&#20026;&#26680;&#24515;&#30340;&#35774;&#35745;&#24605;&#24819;&#65292;&#26159;&#19968;&#20010;&#24615;&#33021;&#31283;&#23450;&#30340;&#22810;&#29992;&#25143;&#32593;&#32476;&#25805;&#20316;&#31995;&#32479;&#12290;&#23427;&#20027;&#35201;&#29992;&#20110;&#22522;&#20110;Intel x86&#31995;&#21015;CPU&#30340;&#35745;&#31639;&#26426;&#19978;&#12290;&#36825;&#20010;&#31995;&#32479;&#26159;&#30001;&#20840;&#19990;&#30028;&#21508;&#22320;&#30340;&#25104;&#21315;&#19978;&#19975;&#30340;&#31243;&#24207;&#21592;&#35774;&#35745;&#21644;&#23454;&#29616;&#30340;&#12290;&#20854;&#30446;&#30340;&#26159;&#24314;&#31435;&#19981;&#21463;&#20219;&#20309;&#21830;&#21697;&#21270;&#36719;&#20214;&#30340;&#29256;&#26435;&#21046;&#32422;&#30340;&#12289;&#20840;&#19990;&#30028;&#37117;&#33021;&#33258;&#30001;&#20351;&#29992;&#30340;Unix&#20860;&#23481;&#20135;&#21697;&#12290;[1]
&#12288;&#12288;Linux&#20197;&#23427;&#30340;&#39640;&#25928;&#24615;&#21644;&#28789;&#27963;&#24615;&#33879;&#31216;&#65292;Linux&#27169;&#22359;&#21270;&#30340;&#35774;&#35745;&#32467;&#26500;&#65292;&#20351;&#24471;&#23427;&#26082;&#33021;&#22312;&#20215;&#26684;&#26114;&#36149;&#30340;&#24037;&#20316;&#31449;&#19978;&#36816;&#34892;&#65292;&#20063;&#33021;&#22815;&#22312;&#24265;&#20215;&#30340;PC&#26426;&#19978;&#23454;&#29616;&#20840;&#37096;&#30340;Unix&#29305;&#24615;&#65292;&#20855;&#26377;&#22810;&#20219;&#21153;&#12289;&#22810;&#29992;&#25143;&#30340;&#33021;&#21147;&#12290;Linux&#26159;&#22312;GNU&#20844;&#20849;&#35768;&#21487;&#26435;&#38480;&#19979;&#20813;&#36153;&#33719;&#24471;&#30340;&#65292;&#26159;&#19968;&#20010;&#31526;&#21512;POSIX&#26631;&#20934;&#30340;&#25805;&#20316;&#31995;&#32479;&#12290;Linux&#25805;&#20316;&#31995;&#32479;&#36719;&#20214;&#21253;&#19981;&#20165;&#21253;&#25324;&#23436;&#25972;&#30340;Linux&#25805;&#20316;&#31995;&#32479;&#65292;&#32780;&#19988;&#36824;&#21253;&#25324;&#20102;&#25991;&#26412;&#32534;&#36753;&#22120;&#12289;&#39640;&#32423;&#35821;&#35328;&#32534;&#35793;&#22120;&#31561;&#24212;&#29992;&#36719;&#20214;&#12290;&#23427;&#36824;&#21253;&#25324;&#24102;&#26377;&#22810;&#20010;&#31383;&#21475;&#31649;&#29702;&#22120;&#30340;X-Windows&#22270;&#24418;&#29992;&#25143;&#30028;&#38754;&#65292;&#22914;&#21516;&#25105;&#20204;&#20351;&#29992;Windows NT&#19968;&#26679;&#65292;&#20801;&#35768;&#25105;&#20204;&#20351;&#29992;&#31383;&#21475;&#12289;&#22270;&#26631;&#21644;&#33756;&#21333;&#23545;&#31995;&#32479;&#36827;&#34892;&#25805;&#20316;&#12290;[2]
   </p>
    <p><b>&#22522;&#26412;&#24605;&#24819;. </b>
        Linux&#30340;&#22522;&#26412;&#24605;&#24819;&#26377;&#20004;&#28857;&#65306;&#31532;&#19968;&#65292;&#19968;&#20999;&#37117;&#26159;&#25991;&#20214;&#65307;&#31532;&#20108;&#65292;&#27599;&#20010;&#36719;&#20214;&#37117;&#26377;&#30830;&#23450;&#30340;&#29992;&#36884;&#12290;&#20854;&#20013;&#31532;&#19968;&#26465;&#35814;&#32454;&#26469;&#35762;&#23601;&#26159;&#31995;&#32479;&#20013;&#30340;&#25152;&#26377;&#20869;&#23481;&#37117;&#24402;&#32467;&#20026;&#19968;&#20010;&#25991;&#20214;&#65292;&#21253;&#25324;&#21629;&#20196;&#12289;&#30828;&#20214;&#21644;&#36719;&#20214;&#35774;&#22791;&#12289;&#25805;&#20316;&#31995;&#32479;&#12289;&#36827;&#31243;&#31561;&#31561;&#12290;&#23545;&#20110;&#25805;&#20316;&#31995;&#32479;&#20869;&#26680;&#32780;&#35328;&#65292;&#37117;&#34987;&#35270;&#20026;&#25317;&#26377;&#21508;&#33258;&#29305;&#24615;&#25110;&#31867;&#22411;&#30340;&#25991;&#20214;&#12290;&#33267;&#20110;&#35828;Linux&#26159;&#22522;&#20110;Unix&#30340;&#65292;&#24456;&#22823;&#31243;&#24230;&#19978;&#20063;&#26159;&#22240;&#20026;&#36825;&#20004;&#32773;&#30340;&#22522;&#26412;&#24605;&#24819;&#21313;&#20998;&#30456;&#36817;&#12290;
    </p>
    <p><b>&#23436;&#20840;&#20813;&#36153;. </b>
        &#12288;Linux&#26159;&#19968;&#27454;&#20813;&#36153;&#30340;&#25805;&#20316;&#31995;&#32479;&#65292;&#29992;&#25143;&#21487;&#20197;&#36890;&#36807;&#32593;&#32476;&#25110;&#20854;&#20182;&#36884;&#24452;&#20813;&#36153;&#33719;&#24471;&#65292;&#24182;&#21487;&#20197;&#20219;&#24847;&#20462;&#25913;&#20854;&#28304;&#20195;&#30721;&#12290;&#36825;&#26159;&#20854;&#20182;&#30340;&#25805;&#20316;&#31995;&#32479;&#25152;&#20570;&#19981;&#21040;&#30340;&#12290;&#27491;&#26159;&#30001;&#20110;&#36825;&#19968;&#28857;&#65292;&#26469;&#33258;&#20840;&#19990;&#30028;&#30340;&#26080;&#25968;&#31243;&#24207;&#21592;&#21442;&#19982;&#20102;Linux&#30340;&#20462;&#25913;&#12289;&#32534;&#20889;&#24037;&#20316;&#65292;&#31243;&#24207;&#21592;&#21487;&#20197;&#26681;&#25454;&#33258;&#24049;&#30340;&#20852;&#36259;&#21644;&#28789;&#24863;&#23545;&#20854;&#36827;&#34892;&#25913;&#21464;&#65292;&#36825;&#35753;Linux&#21560;&#25910;&#20102;&#26080;&#25968;&#31243;&#24207;&#21592;&#30340;&#31934;&#21326;&#65292;&#19981;&#26029;&#22766;&#22823;
    </p>
    <p><b>&#22810;&#29992;&#25143;&#12289;&#22810;&#20219;&#21153;. </b>
        Linux&#25903;&#25345;&#22810;&#29992;&#25143;&#65292;&#21508;&#20010;&#29992;&#25143;&#23545;&#20110;&#33258;&#24049;&#30340;&#25991;&#20214;&#35774;&#22791;&#26377;&#33258;&#24049;&#29305;&#27530;&#30340;&#26435;&#21033;&#65292;&#20445;&#35777;&#20102;&#21508;&#29992;&#25143;&#20043;&#38388;&#20114;&#19981;&#24433;&#21709;&#12290;&#22810;&#20219;&#21153;&#21017;&#26159;&#29616;&#22312;&#30005;&#33041;&#26368;&#20027;&#35201;&#30340;&#19968;&#20010;&#29305;&#28857;&#65292;Linux&#21487;&#20197;&#20351;&#22810;&#20010;&#31243;&#24207;&#21516;&#26102;&#24182;&#29420;&#31435;&#22320;&#36816;&#34892;&#12290;
    </p>
    <p><b>&#20016;&#23500;&#30340;&#32593;&#32476;&#21151;&#33021;. </b>
        Unix&#26159;&#22312;&#20114;&#32852;&#32593;&#30340;&#22522;&#30784;&#19978;&#32321;&#33635;&#36215;&#26469;&#30340;&#65292;Linux&#30340;&#32593;&#32476;&#21151;&#33021;&#24403;&#28982;&#19981;&#20250;&#36874;&#33394;&#12290;&#23427;&#30340;&#32593;&#32476;&#21151;&#33021;&#21644;&#20854;&#20869;&#26680;&#32039;&#23494;&#30456;&#36830;&#65292;&#22312;&#36825;&#26041;&#38754;Linux&#35201;&#20248;&#20110;&#20854;&#20182;&#25805;&#20316;&#31995;&#32479;&#12290;&#22312;Linux&#20013;&#65292;&#29992;&#25143;&#21487;&#20197;&#36731;&#26494;&#23454;&#29616;&#32593;&#39029;&#27983;&#35272;&#12289;&#25991;&#20214;&#20256;&#36755;&#12289;&#36828;&#31243;&#30331;&#38470;&#31561;&#32593;&#32476;&#24037;&#20316;&#12290;&#24182;&#19988;&#21487;&#20197;&#20316;&#20026;&#26381;&#21153;&#22120;&#25552;&#20379;WWW&#12289;FTP&#12289;E-Mail&#31561;&#26381;&#21153;&#12290;
    </p>
    <p><b>&#20869;&#26680;. </b>Linux&#26159;&#26368;&#21463;&#27426;&#36814;&#30340;&#33258;&#30001;&#30005;&#33041;&#25805;&#20316;&#31995;&#32479;&#20869;&#26680;&#12290;&#23427;&#26159;&#19968;&#20010;&#29992;C&#35821;&#35328;&#21644;&#27719;&#32534;&#35821;&#35328;&#20889;&#25104;&#65292;&#31526;&#21512;POSIX&#26631;&#20934;&#30340;&#31867;Unix&#25805;&#20316;&#31995;&#32479;&#12290;Linux&#26368;&#26089;&#26159;&#30001;&#33452;&#20848;&#40657;&#23458;&#26519;&#32435;&#26031;.&#25176;&#29926;&#20857;&#65288;Linus B. Torvalds&#65289;&#20026;&#23581;&#35797;&#22312;&#33521;&#29305;&#23572;x86&#26550;&#26500;&#19978;&#25552;&#20379;&#33258;&#30001;&#20813;&#36153;&#30340;&#31867;Unix&#25805;&#20316;&#31995;&#32479;&#32780;&#24320;&#21457;&#30340;&#12290;&#35813;&#35745;&#21010;&#24320;&#22987;&#20110;1991&#24180;&#65292;&#26519;&#32435;&#26031;·&#25176;&#29926;&#20857;&#24403;&#26102;&#22312;Usenet&#26032;&#38395;&#32452;comp.os.minix&#30331;&#36733;&#24086;&#23376;&#65292;&#36825;&#20221;&#33879;&#21517;&#30340;&#24086;&#23376;&#26631;&#31034;&#30528;Linux&#35745;&#21010;&#30340;&#27491;&#24335;&#24320;&#22987;&#12290;
&#12288;&#12288;&#22312;&#35745;&#21010;&#30340;&#26089;&#26399;&#26377;&#19968;&#20123;Minix&#40657;&#23458;&#25552;&#20379;&#20102;&#21327;&#21161;&#65292;&#32780;&#20170;&#22825;&#20840;&#29699;&#26080;&#25968;&#31243;&#24207;&#21592;&#27491;&#22312;&#20026;&#35813;&#35745;&#21010;&#26080;&#20607;&#25552;&#20379;&#24110;&#21161;&#12290;
&#12288;&#12288;&#25216;&#26415;&#19978;&#35828;Linux&#26159;&#19968;&#20010;&#20869;&#26680;&#12290;&#8220;&#20869;&#26680;&#8221;&#25351;&#30340;&#26159;&#19968;&#20010;&#25552;&#20379;&#30828;&#20214;&#25277;&#35937;&#23618;&#12289;&#30913;&#30424;&#21450;&#25991;&#20214;&#31995;&#32479;&#25511;&#21046;&#12289;&#22810;&#20219;&#21153;&#31561;&#21151;&#33021;&#30340;&#31995;&#32479;&#36719;&#20214;&#12290;&#19968;&#20010;&#20869;&#26680;&#19981;&#26159;&#19968;&#22871;&#23436;&#25972;&#30340;&#25805;&#20316;&#31995;&#32479;&#12290;&#19968;&#22871;&#22522;&#20110;Linux&#20869;&#26680;&#30340;&#23436;&#25972;&#25805;&#20316;&#31995;&#32479;&#21483;&#20316;Linux&#25805;&#20316;&#31995;&#32479;&#65292;&#25110;&#26159;GNU/Linux&#12290;[10]
&#12288;&#12288;Linux&#20869;&#26680;&#26377;&#19977;&#20010;&#19981;&#21516;&#30340;&#21629;&#21517;&#26041;&#26696;&#65306;
&#12288;&#12288;&#26089;&#26399;&#29256;&#26412;&#65306;&#31532;&#19968;&#20010;&#29256;&#26412;&#30340;&#20869;&#26680;&#26159;0.01&#12290;&#20854;&#27425;&#26159;0.02,0.03,0.10,0.11,0.12&#65288;&#31532;&#19968;GPL&#29256;&#26412;&#65289;&#65292;0.95,0.96,0.97,0.98,0.99&#21450;1.0&#12290;&#20174;0.95&#29256;&#26377;&#35768;&#22810;&#30340;&#34917;&#19969;&#21457;&#24067;&#20110;&#20027;&#35201;&#29256;&#26412;&#20043;&#38388;&#12290;[11]
&#12288;&#12288;&#26087;&#35745;&#21010;&#65288;1.0&#21644;2.6&#29256;&#20043;&#38388;&#65289;&#65292;&#29256;&#26412;&#30340;&#26684;&#24335;&#20026;A.B.C&#65292;&#20854;&#20013;A,B,C&#20195;&#34920;&#65306;
&#12288;&#12288;A&#22823;&#24133;&#24230;&#36716;&#21464;&#30340;&#20869;&#26680;&#12290;&#36825;&#26159;&#24456;&#23569;&#21457;&#29983;&#21464;&#21270;&#65292;&#21482;&#26377;&#24403;&#21457;&#29983;&#37325;&#22823;&#21464;&#21270;&#30340;&#20195;&#30721;&#21644;&#26680;&#24515;&#21457;&#29983;&#25165;&#20250;&#21457;&#29983;&#12290;&#22312;&#21382;&#21490;&#19978;&#26366;&#25913;&#21464;&#20004;&#27425;&#30340;&#20869;&#26680;&#65306;1994&#24180;&#30340;1.0&#21450;1996&#24180;&#30340;2.0&#12290;
&#12288;&#12288;B&#26159;&#25351;&#19968;&#20123;&#37325;&#22823;&#20462;&#25913;&#30340;&#20869;&#26680;&#12290;&#20869;&#26680;&#20351;&#29992;&#20102;&#20256;&#32479;&#30340;&#22855;&#25968;&#27425;&#35201;&#29256;&#26412;&#21495;&#30721;&#30340;&#36719;&#20214;&#21495;&#30721;&#31995;&#32479;&#65288;&#29992;&#20598;&#25968;&#30340;&#27425;&#35201;&#29256;&#26412;&#21495;&#30721;&#26469;&#34920;&#31034;&#31283;&#23450;&#29256;&#26412;&#65289;&#12290;
&#12288;&#12288;C&#26159;&#25351;&#36731;&#24494;&#20462;&#35746;&#30340;&#20869;&#26680;&#12290;&#36825;&#20010;&#25968;&#23383;&#24403;&#26377;&#23433;&#20840;&#34917;&#19969;&#65292;bug&#20462;&#22797;&#65292;&#26032;&#30340;&#21151;&#33021;&#25110;&#39537;&#21160;&#31243;&#24207;&#65292;&#20869;&#26680;&#20415;&#20250;&#26377;&#21464;&#21270;&#12290;
&#12288;&#12288;&#31532;&#19977;&#27425;&#65292;&#33258;2.6.0(2003&#24180;12&#26376;&#65289;&#21457;&#24067;&#21518;&#65292;&#20154;&#20204;&#35748;&#35782;&#21040;&#65292;&#26356;&#30701;&#30340;&#21457;&#24067;&#21608;&#26399;&#23558;&#26159;&#26377;&#30410;&#30340;&#12290;&#33258;&#37027;&#26102;&#36215;&#65292;&#29256;&#26412;&#30340;&#26684;&#24335;&#20026;A.B.C.D&#65292;&#20854;&#20013;A,B,C,D&#20195;&#34920;&#65306;A&#21644;B&#26159;&#26080;&#20851;&#32039;&#35201;&#30340;&#65292;C&#26159;&#20869;&#26680;&#30340;&#29256;&#26412;&#65292;D&#26159;&#23433;&#20840;&#34917;&#19969;&#12290;</p>
    <p><b>&#35806;&#29983;&#36807;&#31243;. </b>
        1981 &#24180;IBM&#20844;&#21496;&#25512;&#20986;&#24494;&#22411;&#35745;&#31639;&#26426;IBM PC&#12290;
&#12288;&#12288;1981-1991 &#24180;&#38388;MS-DOS&#25805;&#20316;&#31995;&#32479;&#19968;&#30452;&#26159;&#24494;&#26426;&#19978;&#25805;&#20316;&#31995;&#32479;&#30340;&#20027;&#23472;&#12290;&#27492;&#26102;&#35745;&#31639;&#26426;&#30828;&#20214;&#20215;&#26684;&#34429;&#36880;&#24180;&#19979;&#38477;&#65292;&#20294;&#36719;&#20214;&#20215;&#26684;&#20173;&#23621;&#39640;&#19981;&#19979;&#12290;&#24403;&#26102;Apple &#30340;MACos &#25805;
  &#33258;&#30001;&#36719;&#20214;&#20043;&#29238;&#29702;&#26597;·&#39532;&#20462;·&#26031;&#25176;&#26364;

&#33258;&#30001;&#36719;&#20214;&#20043;&#29238;&#29702;&#26597;·&#39532;&#20462;·&#26031;&#25176;&#26364;
[14]
&#20316;&#31995;&#32479;&#21487;&#20197;&#35828;&#26159;&#24615;&#33021;&#26368;&#22909;&#30340;&#65292;&#20294;&#26159;&#20854;&#22825;&#20215;&#27809;&#20154;&#33021;&#22815;&#36731;&#26131;&#38752;&#36817;&#12290; 
    </p>
    <p><b> </b></p>
    </div>
  </div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">Prev</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="ch02.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">linux&#25216;&#26415;&#25163;&#20876; </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> Chapter 2. &#21629;&#20196;&#27719;&#24635;</td></tr></table></div></body></html>
